<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" lang="fr">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<title>
		Interview d'un d&eacute;veloppeur - TPE : La r&eacute;alit&eacute; dans les jeux vid&eacute;os
	</title>
	<link rel="stylesheet" type="text/css" href="css/base.css" media="all" />
</head>

<body>

<div id="global">

	<div id="entete">
		<h1>TPE : La r&eacute;alit&eacute; dans les jeux vid&eacute;os</h1>
	</div><!-- #entete -->

	<div id="navigation">
		<ul>
			<li class="gauche"><a href="index.html">Accueil</a></li>
			<li class="gauche"><a href="sims3.html">Les Sims 3</a></li>
			<li class="gauche"><a href="morrowind.html">Morrowind</a></li>
			<li class="gauche"><a href="recap.html">R&eacute;capitulatif</a></li>
			<li class="gauche"><a href="interview.html">L'avis d'un d&eacute;veloppeur</a></li>
			<li class="gauche"><a href="bilan.html">Le bilan</a></li>

			<li class="droite"><a href="sources.html">Sources</a></li>	
			<li class="droite"><a href="lexique.html">Lexique</a></li>	
			<li class="droite"><a href="questions-reponses.html">Q / R</a></li>
		</ul>
	</div><!-- #navigation -->

	<div id="centre">

		<div id="principal">
			<h2>Interview d'un d&eacute;veloppeur professionnel</h2><br/>

			
			<p><em>Ahmin Hafidi - Game Designer / Lead QA - Tetraedge Games</em></p>

	
			<p><strong>Rapidement, quel sont les crit&egrave;res qui font qu'un jeu va se vendre ?</strong></p>

			<p>Selon moi, un jeu qui se vend doit avoir un fort <a href="lexique.html">"game appeal"</a>, c'est-&agrave; dire que le jeu soit fun et plaisant &agrave; jouer. &Eacute;galement, je pense que le replay value (rejouabilit&eacute; du jeu) est tr&egrave;s important, ce qui fait que le joueur reviendra dessus, m&ecirc;me le temps d'une petite partie.
			Bien s&ucirc;r, l'enrobage de l'univers du jeu est tr&egrave;s important que ce soit au niveau sonore et graphique, il faut qu'un jeu attire l'oeil pour que le joueur daigne l'acheter.</p>

			
			<p><strong>Trouvez-vous important et prenez-vous en compte cette notion de r&eacute;alit&eacute; lors de la conception de vos jeux vid&eacute;o ?</strong></p>

			<p>Oui et non. La notion de r&eacute;alit&eacute; peut &ecirc;tre incorpor&eacute; &agrave; certains jeux, de diff&eacute;rentes mani&egrave;res, cela peut alors apporter une nouvelle dimension au jeu, que ce soit au niveau de l'interactivit&eacute;, du <a href="lexique.html">gameplay</a> et de l'univers. La notion de r&eacute;alit&eacute; peut &eacute;galement impliquer davantage le joueur dans le jeu.			Cependant, en jouant &agrave; un jeu, le joueur veut &eacute;galement &ecirc;tre absorb&eacute; dans un univers fictif, imaginaire et surtout grisant.
			Travaillant moi-m&ecirc;me sur des jeux d'aventure, je peux prendre pour exemple "Return to Mysterious Island" (sorti sur PC/Mac/iPhone/iPad) le personnage qu'incarne le joueur s' &eacute;choue sur une &icirc;le, il doit alors se nourrir pour reprendre des forces pour ensuite progresser dans l'aventure. La notion de r&eacute;alit&eacute; est alors prise en compte dans ce cas et dans la plupart des jeux d'aventure, o&ugrave; certaines actions sont calqu&eacute;es sur la r&eacute;alit&eacute;.</p>

			
			<p><strong>A quel point un jeu doit-il surprendre le joueur et quel est selon vous le juste compromis entre originalit&eacute; et intuitivit&eacute; ? (par exemple si les sauts ne suivent pas une parabole, cela nuit &agrave; l'intuitivit&eacute;).</strong></p>
			<p>Je pense que le compromis est purement ergonomique. En effet, le jeu doit &ecirc;tre assez original pour attirer les joueurs et assez intuitif pour que le jeu soit parfaitement jouable et donc que le soft soit ergonomique.
			Je pourrais dire qu'il vaut mieux favoriser l'intuitivit&eacute;, quitte &agrave; nuire &agrave; l'originalit&eacute; du jeu, un jeu doit tout d'abord &ecirc;tre ergonomique et plaisant &agrave; jouer. Cependant, le jeu doit &eacute;galement &ecirc;tre original un minimum. Le meilleur exemple de compromis entre ces deux composantes est la hype des jeux ind&eacute;pendants, un des meilleurs exemples est World of Goo, qui est original &agrave; souhait et parfaitement ergonomique (l'intuitivit&eacute; du <a href="lexique.html">gameplay</a> atteint des sommets avec la version iPad !).</p>

			<p><strong>Quelle est selon vous la console la plus &agrave; m&ecirc;me de rapprocher le jeu de la r&eacute;alit&eacute; ? (console &agrave; reconnaissance de mouvement, tactiles, embarquant un acc&eacute;l&eacute;rom&egrave;tre) et pourquoi ?</strong></p>
			<p>
				Je pense que la console la plus apte &agrave; se rapprocher de la notion de r&eacute;alit&eacute; est la Xbox 360 avec le Kinect, car les mouvements sont r&eacute;ellement calqu&eacute;s sur la r&eacute;alit&eacute; (courir, secouer, ...). Il manque plus que des jeux qui permettront une simulation d'une activit&eacute; bas&eacute;e sur la r&eacute;alit&eacute; pour &ecirc;tre dans le bain !

				Avant que le Kinect ne soit annonc&eacute;, la Wii tenait cette place, d&ucirc; &agrave; ses contr&ocirc;les bas&eacute;s sur la Wiimote et son acc&eacute;l&eacute;rom&egrave;tre. &Eacute;galement, des consoles qui utilisent des technologies comme le RFID (console HyperScan de Mattel) o&ugrave; on pose des cartes RFID pour interagir directement avec le jeu.
			</p>

		</div>

		<div id="secondaire">
			<h3>Ordre de lecture sugg&eacute;r&eacute;</h3>
			<ol>
				<li><a href="index.html" >Page d'accueil</a></li>
				<li><a href="questions-reponses.html" >Questions / R&eacute;ponses</a></li>
				<li><a href="morrowind.html" >Morrowind</a></li>
				<li><a href="sims3.html" >Les Sims 3</a></li>
				<li><a href="recap.html" >Le r&eacute;capitulatif</a></li>
				<li><a href="interview.html" >L'interview d'un professionel du jeu vid&eacute;o</a></li>
				<li><a href="bilan.html" >Bilan de nos recherches</a></li>
			</ol>
			<p id="copyright">
				Site cr&eacute;&eacute; pour l'&eacute;preuve de TPE par Alexis Launay, Kilian Ollivier, Gr&eacute;goire Coulombel et Flavien L&eacute;cuyer.
			</p>
		</div><!-- #secondaire -->

	</div><!-- #centre -->

</div><!-- #global -->

<img src="img/sims.png" class="img_top sims" alt="Les Sims"/>
<img src="img/morrowind.png" class="img_top morrowind" alt="Morrowind"/>

</body>
</html>
