<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" lang="fr">
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<title>
		Exemple n°1 : Les sims 3 - TPE : La r&eacute;alit&eacute; dans les jeux vid&eacute;os
	</title>
	<link rel="stylesheet" type="text/css" href="css/base.css" media="all" />
	<link href="zoombox/zoombox.css" rel="stylesheet" type="text/css" media="screen"/>
	
	<script type="text/javascript" src="zoombox/jquery.js"></script>
	<script type="text/javascript" src="zoombox/zoombox.js"></script> 
</head>

<body>

<div id="global">

	<div id="entete">
		<h1>TPE : La r&eacute;alit&eacute; dans les jeux vid&eacute;os</h1>
	</div><!-- #entete -->

	<div id="navigation">
		<ul>
			<li class="gauche"><a href="index.html">Accueil</a></li>
			<li class="gauche"><a href="sims3.html">Les Sims 3</a></li>
			<li class="gauche"><a href="morrowind.html">Morrowind</a></li>
			<li class="gauche"><a href="recap.html">R&eacute;capitulatif</a></li>
			<li class="gauche"><a href="interview.html">L'avis d'un d&eacute;veloppeur</a></li>
			<li class="gauche"><a href="bilan.html">Le bilan</a></li>

			<li class="droite"><a href="sources.html">Sources</a></li>	
			<li class="droite"><a href="lexique.html">Lexique</a></li>	
			<li class="droite"><a href="questions-reponses.html">Q / R</a></li>
		</ul>
	</div><!-- #navigation -->

	<div id="centre">

		<div id="principal">
			<h2 style="color : #ddd">Pr&eacute;sentation</h2>
			
				<h3 id="presentation">Pr&eacute;sentation</h3>
				<p><a href="img/jaquettesims3.jpg" title="Jaquette des sims 3" rel="zoombox"><img src="img/jaquettesims3.jpg" width="200px" alt="Jaquette Les Sims 3" class="fgauche"/></a>
				<p>"Les Sims 3" est un jeu de simulation et de gestion assez connu, mettant en sc&egrave;ne des personnages humains que le joueur doit g&eacute;rer de mani&egrave;re &agrave; d&eacute;velopper leur situation &eacute;conomique, professionnelle et sociale afin de r&eacute;aliser leurs souhaits &agrave; long et court terme. Ce jeu a &eacute;t&eacute; cr&eacute;&eacute; par Electronics Arts et d&eacute;velopp&eacute; par Maxis. Les Sims est un jeu en 3 volets, avec des packs additionnels permettant de d&eacute;bloquer des options suppl&eacute;mentaires. Il est sorti le 3 Juin 2009.</p>
				<!--"Les Sims 3" est un jeu de simulation et de gestion assez connu, mettant en sc&egrave;ne des personnages humains que le joueur
				doit contr&ocirc;ler de mani&egrave;re &agrave; satisfaire les besoins du sim. Ce jeu a &eacute;t&eacute; &eacute;dit&eacute; par Electronics Arts et d&eacute;velopp&eacute; par Maxis.
				Les Sims comptent d&eacute;j&agrave; 3 volets, comportant des pack additionnels permettant de d&eacute;bloquer des options.</p>-->
				
				<!--<h3 id="premiers_pas">Les premiers pas</h3>
				<p>Lorsque l'on commence le jeu "Les Sims 3", nous avons la possibilit&eacute; de cr&eacute;er un ou plusieurs personnages humain, de d&eacute;finir ses caract&eacute;ristiques physiques, sa personnalit&eacute; et ses souhaits &agrave; long terme. Les personnages sont directement immerg&eacute;s dans un quartier avec une somme d'argent pr&eacute;d&eacute;finie. Ler but du jeu est leurs construire une vie, leur permettre une ascension sociale dans ce monde virtuel afin de satisfaire leurs d&eacute;sirs et "souhait &agrave; long terme". Pour cela, nous devons int&eacute;ragir avec l'environnement, les personnages, les objets pr&eacute;sents dans le jeu (l'ordinateur permet de trouver du travail, les voisins permettent de se construire des relations sociales,...).</p>-->

				<h2 style="color : #93cfff">Ce qui a trait &agrave; l'humanit&eacute;</h2>

				<h3 id="morphologie_personnages">Morphologie</h3>
				<p><a href="img/sims/morphologie_persos.jpg" title="Un personnage tr&egrave;s personnalisable" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/morphologie_persos.jpg" alt="Morphologie des personnages"/></a>L'int&eacute;gralit&eacute; des personnages du jeu sont humano&iuml;des et ont &eacute;t&eacute; clairement mod&eacute;lis&eacute;s pour &ecirc;tre le plus fid&egrave;le possible &agrave; la r&eacute;alit&eacute;. Nous devons au d&eacute;but du jeu choisir l'apparence physique et vestimentaire du Sim principal. Il est donc possible de modifier un nombre gigantesque de caract&eacute;ristiques comme la corpulence du personnage, sa musculature, sa couleur de peau, ou encore m&ecirc;me ses tatouages, ses boucles d'oreilles ou la longueur de son menton. M&ecirc;me apr&egrave;s ce param&eacute;trage pouss&eacute;, il reste impossible de pr&eacute;voir l'&eacute;volution du physique du personnage au cours du temps. Les mouvements des personnages &agrave; l'&eacute;cran ne sont pas r&eacute;alis&eacute;s au hasard : ils ne se mettent par exemple jamais  dans des situations anatomiquement impossibles pour l'homme.</p>

				<h3 id="caract_humain">L'aspect caract&eacute;ristique de la vie humaine</h3>
				<p><a href="img/sims/aspects_carac.jpg" title="Les comp&eacute;tences des Sims" rel="zoombox"><img class="fgauche" width="200px" src="img/sims/aspects_carac.jpg" alt="L'aspect caract&eacute;ristique de la vie humaine"/></a>On reconna&icirc;t &eacute;galement la plupart des caract&eacute;ristiques de la vie humaine, telles que la possibilit&eacute; de faire la cuisine, d'emprunter les moyens de transports, et beaucoup d'autres t&acirc;ches quotidiennes. La plupart de ces activit&eacute;s correspondent &agrave; des comp&eacute;tences, grad&eacute;es en plusieurs niveaux comme la cuisine, la m&eacute;canique, le nettoyage. On peut ajouter la pr&eacute;sence de m&eacute;tiers que peuvent exercer les Sims (astronaute, policier, voleur...). Il n'est malgr&eacute; tout pas possible de multiplier les emplois comme dans la r&eacute;alit&eacute;. Enfin, les Sims &eacute;voluent dans un monde social identique &agrave; celui de la r&eacute;alit&eacute;  et entretiennent des contacts familiaux, professionnels ou encore amoureux.</p>
				
				<object classid="clsid:d27cdb6e-ae6d-11cf-96b8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=10,0,0,0" width="550" height="400" id="KAWAplayer_v1" align="middle">
					<param name="allowScriptAccess" value="sameDomain"/>
					<param name="allowFullScreen" value="true"/>
					<param name="movie" value="KAWAplayer_v1/KAWAplayer_v1.swf"/>
					<param name="quality" value="high"/>
					<param name="bgcolor" value="#000000"/>
					<param name="flashvars" value="myMovie=videos/construction_maison.mp4"/>
					<embed src="KAWAplayer_v1/KAWAplayer_v1.swf" quality="high" bgcolor="#000000" width="550" height="400" name="KAWAplayer_v1" align="middle" allowScriptAccess="sameDomain" allowFullScreen="true" type="application/x-shockwave-flash" pluginspage="http://www.adobe.com/go/getflashplayer_fr" flashvars="myMovie=videos/construction_maison.mp4"/>
				</object>
				<p style="text-align : center" ><em>La construction d'une maison</em></p>

				<h3 id="reprod_comportement">Comportement humain, caractère et émotions...</h3>
				<p><a href="img/sims/caracteres.jpg" title="Les traits de caractère du Sim sont personnalisables" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/caracteres.jpg" alt="Les caract&egrave;res des personnages"/></a>Chaque personnage pr&eacute;sente un caract&egrave;re diff&eacute;rent. Ceux-ci sont param&eacute;trables au d&eacute;but de la partie et font que le personnage r&eacute;agit de telle ou telle mani&egrave;re  devant les diff&eacute;rentes situations auxquelles il peut &ecirc;tre confront&eacute;. Si par exemple un objet g&ecirc;ne le passage, il peut devenir &eacute;nerv&eacute; s'il a le trait de caract&egrave;re N&eacute;vros&eacute; ou bien se retrouver d&eacute;moralis&eacute; s'il est &eacute;tourdi et devenir joyeux pendant une f&ecirc;te s'il est Excit&eacute;. Le caract&egrave;re des Sims non jouables avec lesquels notre personnage peut int&eacute;ragir est en g&eacute;n&eacute;ral choisit par le studio de d&eacute;veloppement ou g&eacute;n&eacute;r&eacute; de fa&ccedil;on al&eacute;atoire pour ceux d'entre eux les moins importants.</p>

				<h3 id="cycle_vie">Le cycle de vie du personnage</h3>
				<p><a href="img/sims/cycle_vie.bmp" title="Les Sims ob&eacute;issent aux lois du temps" rel="zoombox"><img class="fgauche" width="200px" src="img/sims/cycle_vie.bmp" alt="Le cycle de vie du personnage"/></a>Le cycle de vie r&eacute;el du personnage est respect&eacute; dans le jeu, puisque le personnage est tout d'abord bambin, puis enfant, adolescent, jeune adulte, adulte, et enfin vieillard. &agrave; l'inverse, ce cycle de vie est relativement court par rapport &agrave; la vitesse de d&eacute;roulement du jeu (l'enfance ne dure  environ qu'une semaine). Il n'y a aucune &eacute;volution pr&eacute;sente entre les &eacute;tapes interm&eacute;diaires et il est possible de d&eacute;marrer le jeu &agrave; partir d'une certaine &eacute;tape du cycle de vie.</p>

				<h3 id="systeme_economique">L'utilisation d'un syst&egrave;me &eacute;conomique</h3>
				<p><a href="img/sims/syst_eco.jpg" title="Acheter une cabine de douche, construire une maison : en r&eacute;alit&eacute; comme dans les Sims, cela est tr&egrave;s cher" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/syst_eco.jpg" alt="L'utilisation d'un syst&egrave;me &eacute;conomique"/></a>"Les Sims 3" pr&eacute;sente aussi un syst&egrave;me &eacute;conomique dont monnaie est le Simflouz, simbolis&eacute; par un "§". Cet argent virtuel permet d'acheter des mat&eacute;riaux de construction, des objets pour remplir la maison dans laquelle vie le Sim et des services (&agrave; pr&eacute;ciser). Cet argent peut est en partie gagn&eacute; par le Sims lorsqu'il travaille, qu'il vole ou qu'il vend (autre moyens ?). Cet argent est la base et l'int&eacute;r&ecirc;t du jeu : le but est d'enrichir son personnage.</p>
				
				<h2 style="color : #afe800">La reproduction des lois physiques</h2>

				<h3 id="pesanteur">La Pesanteur</h3>
				<p><a href="img/sims/pesanteur.bmp" title="Les personnages sautent et retombent" rel="zoombox"><img class="fgauche" width="100px" src="img/sims/pesanteur.bmp" alt="La Pesanteur"/></a>Ce jeu respecte la loi de la gravit&eacute; dans la plupart des animations. D&egrave;s qu'un personnage saute, il retombe automatiquement ou encore lorsqu'un Sim plonge dans une piscine, il retombe dans l'eau et ne marche &agrave; sa surface, tout comme il est totalement impossible qu'il reste en suspension dans l'air.</p>

				<h3 id="collisions_et_interactions">Les collisions et les interactions</h3>
				<p><a href="img/sims/collisions.jpg" title="Des fant&ocirc;mes qui traversent les murs" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/collisions.jpg" alt="Les collisions et les interactions"/></a>Malgr&eacute; la loi de la gravit&eacute;, le jeu ne respecte pas toujours la loi des collisions et des r&eacute;actions. En effet, quand une voiture veut en doubler une autre, elle passe &agrave; travers au lieu de passer sur l'autre file comme en r&eacute;alit&eacute;. De plus, lorsque la porte d'un objet est ouverte, elle peut passer au travers d'un mur qui aurait la possibilit&eacute; de se trouver &agrave; proximit&eacute;.</p>

				<h3 id="perspectives_reflet_lumiere">Perspectives, reflets et jeux de lumi&egrave;re</h3>
				<p><a href="img/sims/reflets.bmp" title="Le reflet dans le miroir montre le personnage de dos" rel="zoombox"><img class="fgauche" width="150px" src="img/sims/reflets.bmp" alt="Perspectives, reflets et jeux de lumi&egrave;re"/></a>L'effet de perspective est respect&eacute; dans le jeu afin d'augmenter le r&eacute;alisme de cette vision 3D, puisqu'il s'agit de d&eacute;cors et de graphismes essentiellement en 3 dimensions. &agrave; la mani&egrave;re d'une image filmique, les d&eacute;cors pr&eacute;sentent un point de fuite et ce qui est plus loin est plus petit et plus orient&eacute; vers ce point. Ces d&eacute;cors ne sont donc pas plats, et l'on peut diriger, gr&acirc;ce &agrave; la souris, le point de vue. Pour terminer, les reflets sont en r&egrave;gle g&eacute;n&eacute;rale g&eacute;r&eacute;s. Si par exemple un Sim se place devant un miroir, ce que l'on peut observer d&egrave;s le d&eacute;but du jeu, lors de la cr&eacute;ation de celui-ci, il est possible de voir son reflet dans le miroir. Par contre, cela ne se produit pas avec la surface de l'eau. Les jeux de lumi&egrave;res sont donc &eacute;galement pr&eacute;sents, puisque les objets et les murs sont des sources d'ombres. Celles-ci sont diff&eacute;rement plac&eacute;es en fonction de la position du soleil. Ainsi, deux fen&ecirc;tres plac&eacute;es selon des orientations diff&eacute;rentes laisseront entrer plus ou moins la lumi&egrave;re en fonction de leur placement.</p>
				
				<object classid="clsid:d27cdb6e-ae6d-11cf-96b8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=10,0,0,0" width="550" height="400" id="KAWAplayer_v1" align="middle">
					<param name="allowScriptAccess" value="sameDomain"/>
					<param name="allowFullScreen" value="true"/>
					<param name="movie" value="KAWAplayer_v1/KAWAplayer_v1.swf"/>
					<param name="quality" value="high"/>
					<param name="bgcolor" value="#000000"/>
					<param name="flashvars" value="myMovie=videos/ombre.mp4"/>
					<embed src="KAWAplayer_v1/KAWAplayer_v1.swf" quality="high" bgcolor="#000000" width="550" height="400" name="KAWAplayer_v1" align="middle" allowScriptAccess="sameDomain" allowFullScreen="true" type="application/x-shockwave-flash" pluginspage="http://www.adobe.com/go/getflashplayer_fr" flashvars="myMovie=videos/ombre.mp4"/>
				</object>
				<p style="text-align : center" ><em>Le d&eacute;placement des ombres</em></p>

				<h2 style="color : #dc92ff">Un environnement de jeu toujours plus r&eacute;aliste</h2>

				<h3 id="environnement">Les paysages et la carte du monde</h3>
				<p><a href="img/sims/carte.jpg" title="La ville" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/carte.jpg" alt="Les paysages et la carte du monde"/></a>Les paysages du jeu sont en 3 dimensions, ainsi que la carte, qui d'ailleurs n'est pas une carte du monde, mais une carte de la ville. L'environnement dans lequel &eacute;volue le Sim est tr&egrave;s riche. De plus, la carte de la ville pr&eacute;sente un certain relief (elle comporte des montagnes, des lacs,...)</p>

				<h3 id="meteo">Le cycle Jour/Nuit, l'&eacute;volution de l'environnement, les conditions m&eacute;t&eacute;orologiques</h3>
				<p><a href="img/sims/jour_nuit.bmp" title="Photomontage montrant une partie de la ville sous la nuit et la même pendant la journ&eacute;e" rel="zoombox"><img class="fgauche" width="200px" src="img/sims/jour_nuit.bmp" alt="Le cycle Jour/Nuit"/></a>En outre, il pr&eacute;sente un cycle Jour/Nuit, puisque l'on a, dans l'ordre : la nuit, l'aurore, le jour, le cr&eacute;puscule. En revanche, ce cycle se d&eacute;roule toujours aux m&ecirc;mes heures. On voit &eacute;galement que les objets sont tr&egrave;s souvent soumis au cycle du temps. Par exemple, de la nourriture laiss&eacute;e trop longtemps sur un support fini par p&eacute;rimer et sentir mauvais. Enfin, les conditions m&eacute;t&eacute;orologiques sont inexistantes, et le temps du jeu reste toujours ensoleill&eacute;.</p>

				<h3 id="bruitages_et_ambiances">Les bruitages l'ambiance sonore</h3>
				<p><a href="img/sims/conversation.jpg" title="Des Sims en pleine conversation" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/conversation.jpg" alt="Les bruitages l'ambiance sonore"/></a>L'ambiance sonore est compos&eacute;e d'une musique de fond, qui est une musique pr&eacute;d&eacute;finie. Elle ne change que lorsque le Sim allume la radio, ou qu'il se passe quelque chose d'important (l'arriv&eacute;e d'un b&eacute;b&eacute;, un incendie, un voleur,...). De plus, les personnages s'expriment entre eux par le biais d'un langage appel&eacute; le Simlish, qui est un langage imaginaire, compos&eacute; de navajo (une langue parl&eacute;e dans le Sud des &eacute;tats-Unis), de fran&ccedil;ais, d'anglais, de finnois, d'ukrainien, de tagalog (langue philippine) et de latin. Au niveau des bruitages, seuls les objets produisent de r&eacute;els bruits (la chasse d'eau, l'ordinateur,...)</p>

				<h3 id="graphismes">Les graphismes de plus en plus r&eacute;alistes</h3>
				<p><a href="img/sims/amelioration.bmp" title="Gauche : Les Sims sorti en 2000. Droite : Les Sims 3 sorti en 2009" rel="zoombox"><img class="fgauche" width="200px" src="img/sims/amelioration.bmp" alt="Les graphismes de plus en plus r&eacute;alistes"/></a>Depuis le premier volet du jeu, "Les Sims", au dernier volet en date, "Les Sims 3", l'am&eacute;lioration graphique est nettement visible. En effet, dans le premier jeu, la carte de la ville restait tr&egrave;s basique et n'&eacute;tait compos&eacute;e que d'un seul quartier. De plus, au fil du temps, le jeu a propos&eacute; des outils de personnalisation encore plus d&eacute;velopp&eacute;s. Cela cause, en contrepartie, des co&ucirc;ts assez importants, de mani&egrave;re &agrave; se procurer une carte graphique suffisamment puissante pour utiliser le jeu tout en restant &agrave; l'abri des "bugs".</p>

				<h2 style="color : #e81600">Autres</h2>

				<h3 id="codes_triche">Les codes de triches</h3>
				<p><a href="img/sims/codes_triche.bmp" title="Les codes de triche" rel="zoombox"><img class="fdroite" width="200px" src="img/sims/codes_triche.bmp" alt="Les codes de triches"/></a>Enfin, des codes de triche peuvent &ecirc;tre utilis&eacute;s. Gr&acirc;ce &agrave; ces codes, le joueur peut faire gagner de l'argent au personnage facilement, lui approprier plus de terrain, d&eacute;placer des objets normalement non d&eacute;pla&ccedil;ables (la bo&icirc;te au lettres, et m&ecirc;me des personnages), et de satisfaire tous les besoins, ainsi que de nombreuses autres possibilit&eacute;s. Cela rend le jeu beaucoup moins r&eacute;aliste. (dans la vraie vie, l'argent ne tombe pas du ciel).</p>
		</div>

		<div id="secondaire">

			<h3>Ordre de lecture sugg&eacute;r&eacute;</h3>
			<ol>
				<li><a href="index.html" >Page d'accueil</a></li>
				<li><a href="questions-reponses.html" >Questions / R&eacute;ponses</a></li>
				<li><a href="morrowind.html" >Morrowind</a></li>
				<li><a href="sims3.html" >Les Sims 3</a></li>
				<li><a href="recap.html" >Le r&eacute;capitulatif</a></li>
				<li><a href="interview.html" >L'interview d'un professionel du jeu vid&eacute;o</a></li>
				<li><a href="bilan.html" >Bilan de nos recherches</a></li>
			</ol>
			<h3>Plan de la page</h3>
			<ul>
				<li>Ce qui a trait &agrave; l'humanit&eacute;
					<ul>
						<li><a href="#morphologie_personnages">Morphologie des personnages</a></li>
						<li><a href="#reprod_comportement">Comportement humain, caract&egrave;re et &eacute;motions...</a></li>
						<li><a href="#caract_humain">Aspect caract&eacute;ristique de la vie humaine</a></li>
						<li><a href="#cycle_vie">Le cycle de vie</a></li>
						<li><a href="#systeme_economique">Utilisation d'un syst&egrave;me &eacute;conomique</a></li>
					</ul>
				</li>
				<li>La reproduction des lois physiques
					<ul>
						<li><a href="#pesanteur">La pesanteur</a></li>
						<li><a href="#collisions_et_interactions">Collisions et int&eacute;raction</a></li>
						<li><a href="#perspectives_reflet_lumiere">Perspectives, reflets et jeux de lumi&egrave;re</a></li>
					</ul>
				</li>
				<li>Un environnement de jeu toujours plus r&eacute;aliste
					<ul>
						<li><a href="#environnement">Les paysages et la carte du monde</a></li>
						<li><a href="#meteo">Cycle jour/nuit et conditions m&eacute;t&eacute;orologiques</a></li>
						<li><a href="#bruitages_et_ambiances">Bruitages et ambiances</a></li>
						<li><a href="#graphismes">Les graphismes de plus en plus r&eacute;alistes</a></li>
					</ul>
				</li>
				<li>Autres
					<ul>
						<li><a href="#codes_triche">Les codes de triche</a></li>
					</ul>
				</li>		
			</ul>
			
			<p id="copyright">
				Site cr&eacute;&eacute; pour l'&eacute;preuve de TPE par Alexis Launay, Kilian Ollivier, Gr&eacute;goire Coulombel et Flavien L&eacute;cuyer.
			</p>
		</div><!-- #secondaire -->

	</div><!-- #centre -->

</div><!-- #global -->

<img src="img/sims.png" class="img_top sims" alt="Les Sims"/>
<img src="img/morrowind.png" class="img_top morrowind" alt="Morrowind"/>

</body>
</html>
